<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>handbook</title>
    <link rel="stylesheet" type="text/css" href="../../../../../static/css/main.css">
</head>
<body>
<div class="nav">
    <div class="logo">
        
            <img src="../../../../../idoc-logo.svg">
        
    </div>
<ul><li><a href="../../../../../index.html">Git常用命令</a></li><li><a href="#"><span></span>前端</a><ul><li><a href="#"><span></span>Javascript</a><ul><li><a href="#"><span></span>RN</a><ul><li><a href="../../../../../html/前端/Javascript/RN/React-native Android环境搭建.html">React-native Android环境搭建</a></li></ul></li><li><a href="../../../../../html/前端/Javascript/思维导图.html">思维导图</a></li><li><a href="../../../../../html/前端/Javascript/正则表达式.html">正则表达式</a></li><li><a href="../../../../../html/前端/Javascript/轻量高效的开源JavaScript插件和库.html">轻量高效的开源JavaScript插件和库</a></li></ul></li></ul></li><li><a href="#"><span></span>服务端编程</a><ul><li><a href="#"><span></span>数据库</a><ul><li><a href="../../../../../html/服务端编程/数据库/Redis.html">Redis</a></li></ul></li><li><a href="#"><span></span>系统服务</a><ul><li><a href="../../../../../html/服务端编程/系统服务/docker.html">docker</a></li><li><a href="#"><span></span>shell</a><ul><li><a href="../../../../../html/服务端编程/系统服务/shell/shell-regex.html">shell-regex</a></li><li><a href="../../../../../html/服务端编程/系统服务/shell/Shell.html">Shell</a></li></ul></li><li><a href="../../../../../html/服务端编程/系统服务/Nginx.html">Nginx</a></li></ul></li><li><a href="#"><span></span>Linux</a><ul></ul></li><li><a href="#"><span></span>数据库</a><ul><li><a href="#"><span></span>mysql</a><ul><li><a href="../../../../../html/服务端编程/数据库/mysql/21-minutes-MySQL-basic-entry.html">21-minutes-MySQL-basic-entry</a></li><li><a href="../../../../../html/服务端编程/数据库/mysql/awesome-mysql.html">awesome-mysql</a></li><li><a href="#"><span></span>chapter1</a><ul><li><a href="../../../../../html/服务端编程/数据库/mysql/chapter1/1.1.html">1.1</a></li><li><a href="../../../../../html/服务端编程/数据库/mysql/chapter1/1.2.html">1.2</a></li><li><a href="../../../../../html/服务端编程/数据库/mysql/chapter1/1.3.html">1.3</a></li><li class="active"><a href="../../../../../html/服务端编程/数据库/mysql/chapter1/1.4.html">1.4</a></li><li><a href="../../../../../html/服务端编程/数据库/mysql/chapter1/1.html">1</a></li></ul></li><li><a href="#"><span></span>chapter17</a><ul><li><a href="../../../../../html/服务端编程/数据库/mysql/chapter17/17.1.html">17.1</a></li><li><a href="../../../../../html/服务端编程/数据库/mysql/chapter17/17.2.html">17.2</a></li><li><a href="../../../../../html/服务端编程/数据库/mysql/chapter17/17.3.html">17.3</a></li></ul></li><li><a href="#"><span></span>chapter2</a><ul><li><a href="../../../../../html/服务端编程/数据库/mysql/chapter2/2.1.html">2.1</a></li><li><a href="../../../../../html/服务端编程/数据库/mysql/chapter2/2.2.html">2.2</a></li><li><a href="../../../../../html/服务端编程/数据库/mysql/chapter2/2.3.html">2.3</a></li><li><a href="../../../../../html/服务端编程/数据库/mysql/chapter2/2.4.html">2.4</a></li><li><a href="../../../../../html/服务端编程/数据库/mysql/chapter2/2.5.html">2.5</a></li></ul></li><li><a href="#"><span></span>chapter3</a><ul><li><a href="../../../../../html/服务端编程/数据库/mysql/chapter3/3.1.html">3.1</a></li><li><a href="../../../../../html/服务端编程/数据库/mysql/chapter3/3.2.html">3.2</a></li><li><a href="../../../../../html/服务端编程/数据库/mysql/chapter3/3.3.html">3.3</a></li><li><a href="../../../../../html/服务端编程/数据库/mysql/chapter3/3.4.html">3.4</a></li><li><a href="../../../../../html/服务端编程/数据库/mysql/chapter3/3.5.html">3.5</a></li><li><a href="../../../../../html/服务端编程/数据库/mysql/chapter3/3.html">3</a></li></ul></li><li><a href="../../../../../html/服务端编程/数据库/mysql/README.html">README</a></li></ul></li><li><a href="../../../../../html/服务端编程/数据库/Redis.html">Redis</a></li></ul></li></ul></li><li><a href="#"><span></span>工具快捷键</a><ul><li><a href="../../../../../html/工具快捷键/Git常用命令.html">Git常用命令</a></li><li><a href="../../../../../html/工具快捷键/vim.html">vim</a></li></ul></li><li><a href="#"><span></span>其他</a><ul><li><a href="../../../../../html/其他/HTTP状态码.html">HTTP状态码</a></li><li><a href="../../../../../html/其他/通过代理工具提高Github Clone速度.html">通过代理工具提高Github Clone速度</a></li></ul></li></ul></div>


<div class="forkgithub"><a target="_blank" href="https://github.com/poetries/handbook.git"></a></div>

<div class="warpper">

    <div class="page-toc">
        <ul><li><a href="#t0如何学习MySQL">如何学习MySQL</a><ul><li><a href="#t1培养兴趣和动力">培养兴趣和动力</a></li><li><a href="#t2了解基础知识">了解基础知识</a></li><li><a href="#t3利用好工具">利用好工具</a></li><li><a href="#t4掌握SQL语句">掌握SQL语句</a></li><li><a href="#t5多动手实践操作">多动手实践操作</a></li><li><a href="#t6记录笔记">记录笔记</a></li><li><a href="#t7高级进阶">高级进阶</a></li></ul></li></ul>
    </div>
    
    <div class="content markdown-body">
        <h1 id="t0&#x5982;&#x4F55;&#x5B66;&#x4E60;MySQL">&#x5982;&#x4F55;&#x5B66;&#x4E60;MySQL <a href="#t0&#x5982;&#x4F55;&#x5B66;&#x4E60;MySQL"> # </a></h1>
<p>&#x5982;&#x4F55;&#x5B66;&#x4E60; MySQL &#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4F2A;&#x547D;&#x9898;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x6709;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x5957;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x4F55;&#x5B66;&#x4E60; MySQL &#x8FD9;&#x4E2A;&#x6D3B;&#x513F;&#xFF0C;&#x6211;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x6211;&#x7684;&#x8FD9;&#x4E2A;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x4F60;&#x6700;&#x597D;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x5B66;&#x4E60; MySQL &#x6570;&#x636E;&#x5E93;&#x4E4B;&#x524D;&#xFF0C;&#x9700;&#x8981;&#x627E;&#x51C6;&#x81EA;&#x5DF1;&#x5B66;&#x4E60; MySQL &#x6700;&#x8212;&#x670D;&#x7684;&#x59FF;&#x52BF;&#x3002;</p>
<p>&#x6211;&#x6765;&#x5206;&#x4EAB;&#x4E00;&#x4E0B;&#x6211;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x505A;&#x4E2A;&#x53C2;&#x8003;&#xFF0C;&#x53EA;&#x80FD;&#x505A;&#x4E2A;&#x53C2;&#x8003;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x96F6;&#x57FA;&#x7840;&#xFF0C;&#x975E;&#x8BA1;&#x7B97;&#x673A;&#x4E13;&#x4E1A;&#xFF0C;&#x6CA1;&#x6709;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x548C;&#x5DE5;&#x4F5C;&#x7ECF;&#x9A8C;&#xFF08;&#x4ECE;&#x524D;&#x662F;&#x505A;&#x8BBE;&#x8BA1;&#x540E;&#x9762;&#x8F6C;&#x524D;&#x7AEF;&#x518D;&#x5230;&#x540E;&#x7AEF;&#xFF09;&#xFF0C;&#x5957;&#x8DEF;&#x76F8;&#x5F53;&#x6DF1;&#x5427;&#x3002;&#x8BF4;&#x5230;&#x8FD9;&#x91CC;&#x5F88;&#x591A;&#x65B0;&#x624B;&#x5174;&#x594B;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x5728;&#x60F3;&#x8FD9;&#x5B59;&#x5B50;&#x6BD4;&#x6211;&#x5DEE;&#x5462;&#xFF0C;&#x6211;&#x8FD8;&#x4ED6;&#x5988;&#x8BA1;&#x7B97;&#x673A;&#x4E13;&#x4E1A;&#x6BD5;&#x4E1A;&#x7684;&#x5462;&#xFF0C;&#x6211;&#x5B66;&#x80AF;&#x5B9A;&#x66F4;&#x5FEB;&#x5165;&#x624B;&#x3002;&#x606D;&#x559C;&#x4F60;&#xFF01;&#x60A8;&#x8FD9;&#x4E48;&#x60F3;&#x5C31;&#x5BF9;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x7684;&#x786E;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x662F;&#x5927;&#x7EA6;&#xFF0C;&#x4E00;&#x5929;&#x5C31;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x5E94;&#x7528; MySQL &#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5E76;&#x4E14;&#x7B2C;&#x4E8C;&#x5929;&#x5C31;&#x505A;&#x51FA;&#x4E0D;&#x9519;&#x7684;&#x529F;&#x80FD;&#x4E86;&#x3002;</p>
<h3 id="t1&#x57F9;&#x517B;&#x5174;&#x8DA3;&#x548C;&#x52A8;&#x529B;">&#x57F9;&#x517B;&#x5174;&#x8DA3;&#x548C;&#x52A8;&#x529B; <a href="#t1&#x57F9;&#x517B;&#x5174;&#x8DA3;&#x548C;&#x52A8;&#x529B;"> # </a></h3>
<p>&#x9996;&#x5148;&#x5F97;&#x57F9;&#x517B;&#x5174;&#x8DA3;&#x7231;&#x597D;&#xFF0C;&#x4E0D;&#x8BBA;&#x5B66;&#x4EC0;&#x4E48;&#x6280;&#x672F;&#x548C;&#x4EC0;&#x4E48;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x5174;&#x8DA3;&#x662F;&#x53EF;&#x4EE5;&#x6781;&#x5927;&#x7684;&#x63D0;&#x9AD8;&#x5B66;&#x4E60;&#x6548;&#x7387;&#x548C;&#x63D0;&#x4F9B;&#x6301;&#x4E45;&#x7684;&#x6218;&#x6597;&#x529B;&#x3002;&#x5F53;&#x7136;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x5174;&#x8DA3;&#x662F;&#x88AB;&#x903C;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x73B0;&#x5728;&#x4E3A;&#x4F55;&#x4F7F;&#x7528; MySQL&#xFF1F; &#x6211;&#x662F;&#x88AB;&#x9879;&#x76EE;&#x8FDB;&#x5EA6;&#xFF0C;&#x8001;&#x677F;&#x8981;&#x6C42;&#xFF0C;&#x670B;&#x53CB;&#x63A8;&#x8350;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x6211;&#x4F7F;&#x7528;&#x5B66;&#x4E60;MySQL&#x7684;&#x5174;&#x8DA3;&#x70B9;&#x4E4B;&#x4E00;&#x3002;&#x518D;&#x6BD4;&#x5982;&#xFF0C;&#x5199;&#x8FD9;&#x4E2A;&#x4E66;&#x4E5F;&#x662F;&#x6709;&#x59D1;&#x5A18;&#x5ACC;&#x5F03;&#x6211;&#x8BFB;&#x4E66;&#x5C11;&#xFF08;&#x5176;&#x5B9E;&#x6211;&#x4F30;&#x8BA1;&#x4EBA;&#x5BB6;&#x5ACC;&#x5F03;&#x6211;&#x5B66;&#x5386;&#xFF0C;&#x8BBA;&#x8BFB;&#x4E66;&#x6307;&#x4E0D;&#x5B9A;&#x6211;&#x8BFB;&#x4E66;&#x6BD4;&#x5979;&#x591A;&#x5462;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x53EA;&#x559C;&#x6B22;&#x8BFB;&#x8BA1;&#x7B97;&#x673A;&#x7C7B;&#x522B;&#x7684;&#x4E66;&#xFF0C;&#x90A3;&#x4E5F;&#x662F;&#x4E66;&#x5427;&#xFF0C;&#x563F;&#x563F;&#xFF09;&#xFF0C;&#x521A;&#x597D;&#x8D76;&#x4E0A;&#x6211;&#x8FD9;&#x4E2A;&#x5B66;&#x4E60; MySQL &#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x6211;&#x60F3;&#x8868;&#x73B0;&#x4E00;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x6211;&#x5199;&#x6B64;&#x4E66;&#x7684;&#x52A8;&#x529B;&#x53CA;&#x5174;&#x8DA3;&#x4E4B;&#x4E00;&#x3002;</p>
<h3 id="t2&#x4E86;&#x89E3;&#x57FA;&#x7840;&#x77E5;&#x8BC6;">&#x4E86;&#x89E3;&#x57FA;&#x7840;&#x77E5;&#x8BC6; <a href="#t2&#x4E86;&#x89E3;&#x57FA;&#x7840;&#x77E5;&#x8BC6;"> # </a></h3>
<p>&#x6211;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x9886;&#x57DF;&#x7ECF;&#x5E38;&#x88AB;&#x4EBA;&#x9119;&#x89C6;&#xFF0C;&#x7ECF;&#x5E38;&#x6709;&#x79D1;&#x73ED;&#x51FA;&#x8EAB;&#x7684;&#x4EBA;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x201C;&#x4F60;&#x5F97;&#x5B66;&#x8BA1;&#x7B97;&#x673A;&#x6280;&#x672F;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x9886;&#x57DF;&#x7684;&#x6280;&#x672F;&#x975E;&#x5E38;&#x5F3A;&#x8C03;&#x57FA;&#x7840;&#xFF0C;&#x56DE;&#x53BB;&#x5927;&#x5B66;&#x6DF7;&#x4E24;&#x5E74;&#x201D;&#xFF0C;&#x8FD9;&#x8BDD;&#x4F60;&#x542C;&#x542C;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x9996;&#x5148;&#x4F60;&#x662F;&#x4E2A;&#x65B0;&#x4EBA;&#xFF0C;&#x5176;&#x6B21;&#xFF0C;&#x4F60;&#x8981;&#x641E;&#x5B9A;&#x591A;&#x5C11;&#x5E76;&#x53D1;&#x3001;&#x8BBF;&#x95EE;&#x3001;IO&#xFF0C;&#x4F60;&#x73B0;&#x5728;&#x8FD8;&#x6CA1;&#x6709;&#x673A;&#x4F1A;&#xFF0C;&#x6709;&#x7684;&#x4EBA;&#x4E00;&#x8F88;&#x5B50;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x673A;&#x4F1A;&#x5E94;&#x7528;&#x9AD8;&#x7EA7;MySQL&#x6280;&#x672F;&#xFF0C;&#x5F53;&#x7136;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x53BB;&#x4E89;&#x53D6;&#x8FD9;&#x6837;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x5E76;&#x4E0D;&#x662F;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x673A;&#x4F1A;&#x5C31;&#x4E0D;&#x53BB;&#x6DF1;&#x5165; MySQL &#x6280;&#x672F;&#x5E94;&#x7528;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x5728; MySQL &#x6280;&#x672F;&#x7684;&#x9053;&#x8DEF;&#x4E0A;&#x8D70;&#x7684;&#x66F4;&#x5FEB;&#x3001;&#x66F4;&#x8FDC;&#xFF0C;&#x4F60;&#x4E0D;&#x5149;&#x8BA1;&#x7B97;&#x673A;&#x57FA;&#x7840;&#x8981;&#x592F;&#x5B9E;&#xFF0C;&#x8FD8;&#x8981;&#x73A9;&#x513F;&#x597D; SQL &#x8BED;&#x53E5;&#x3002;</p>
<h3 id="t3&#x5229;&#x7528;&#x597D;&#x5DE5;&#x5177;">&#x5229;&#x7528;&#x597D;&#x5DE5;&#x5177; <a href="#t3&#x5229;&#x7528;&#x597D;&#x5DE5;&#x5177;"> # </a></h3>
<p>&#x6211;&#x5728;&#x5B66;&#x4E60;&#x7ED8;&#x753B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8001;&#x5E08;&#x7B2C;&#x4E00;&#x5929;&#x5C31;&#x544A;&#x8BC9;&#x4F60;&#x8981;&#x4E70;&#x7ED8;&#x753B;&#x7B14;&#x3001;&#x6C34;&#x7C89;&#x3001;&#x7EB8;&#x3001;&#x753B;&#x677F;&#x3001;&#x652F;&#x67B6;&#x5B50;&#xFF0C;&#x8BA9;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x6B63;&#x786E;&#x7684;&#x7ED8;&#x753B;&#x59FF;&#x52BF;&#x3002;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x51C6;&#x5907;&#x5DE5;&#x5177;&#xFF0C;&#x6240;&#x4EE5;&#x5B66;&#x4E60;&#x524D;&#x4E0D;&#x5149;&#x8981;&#x5B89;&#x88C5;&#x597D;&#x73AF;&#x5883;&#xFF0C;&#x8FD8;&#x5F97;&#x5B89;&#x88C5;&#x597D;&#x5DE5;&#x5177;&#xFF0C;&#x63A8;&#x8350;&#x4F7F;&#x7528;&#x524D;&#x4E00;&#x7AE0;&#x8282;&#x63A8;&#x8350;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177; MyCli &#x914D;&#x5408;GUI&#x6765;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#xFF0C;&#x5229;&#x7528;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x7684;&#x7279;&#x70B9;&#x6765;&#x638C;&#x63E1;SQL&#x8BED;&#x53E5;&#xFF0C;&#x64CD;&#x63A7;&#x6570;&#x636E;&#x3002;&#x9664;&#x4E86;&#x8FD9;&#x4E9B;&#x8F6F;&#x4EF6;&#x5DE5;&#x5177;&#x4E4B;&#x5916;&#x8FD8;&#x8981;&#x6B63;&#x786E;&#x3001;&#x6709;&#x6548;&#x5730;&#x5229;&#x7528;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x8FD9;&#x4E2A;&#x725B;&#x903C;&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x767E;&#x6BD2;&#xFF0C;&#x540E;&#x9762;&#x4F7F;&#x7528;&#x8C37;&#x6B4C;&#xFF08;&#x5982;&#x679C;&#x4F60;&#x6709;&#x7FFB;&#x5899;&#x80FD;&#x529B;&#x53EF;&#x4EE5;&#x4E00;&#x5F00;&#x59CB;&#x4F7F;&#x7528;Google&#xFF09;&#xFF0C;&#x4F60;&#x53EF;&#x901A;&#x8FC7;&#x641C;&#x7D22;&#x5F15;&#x8D77;&#x641C;&#x5230;&#x5F88;&#x591A;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x3002;</p>
<h3 id="t4&#x638C;&#x63E1;SQL&#x8BED;&#x53E5;">&#x638C;&#x63E1;SQL&#x8BED;&#x53E5; <a href="#t4&#x638C;&#x63E1;SQL&#x8BED;&#x53E5;"> # </a></h3>
<p>&#x5728;&#x5B66;&#x4E60;&#x7ED8;&#x753B;&#x51C6;&#x5907;&#x5B8C;&#x5DE5;&#x5177;&#x4E4B;&#x540E;&#xFF0C;&#x7ED8;&#x753B;&#x8001;&#x5E08;&#x5C31;&#x8BA9;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5BF9;&#x7740;&#x4E00;&#x672C;&#x57FA;&#x7840;&#x7684;&#x7ED8;&#x753B;&#x4E66;&#xFF0C;&#x4E34;&#x6479;&#x57FA;&#x672C;&#x7684;&#x7B14;&#x6CD5;&#x5404;&#x79CD;&#x7ED8;&#x753B;&#x7EBF;&#x6761;&#xFF0C;&#x4E34;&#x6479;&#x77F3;&#x818F;&#x51E0;&#x4F55;&#x4F53;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x5FEB;&#x901F;&#x7684;&#x638C;&#x63E1;&#x611F;&#x89C9;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x638C;&#x63E1;&#x597D;SQL&#x8BED;&#x53E5;&#x57FA;&#x7840;&#xFF0C;&#x4E3A;&#x5565; MySQL &#x9996;&#x5148;&#x8981;&#x638C;&#x63E1;&#x597D;SQL&#x8BED;&#x53E5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x5728;&#x5E94;&#x7528;&#x4E2D;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x90FD;&#x662F;&#x901A;&#x8FC7; SQL&#x8BED;&#x53E5;&#x6765;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x5458;&#xFF08;DBA&#xFF09;&#x90A3;&#x5C31;&#x66F4;&#x4E0D;&#x7528;&#x8BF4;&#x4E86;&#xFF0C;&#x9760;GUI&#x6765;&#x6DF7;&#x996D;&#x5403;&#xFF0C;&#x6211;&#x8FD8;&#x5934;&#x4E00;&#x6B21;&#x542C;&#x8BF4;&#x6709;&#x8FD9;&#x6837;&#x7684;DBA&#xFF0C;&#x4F5C;&#x4E3A;DBA&#x4F60;&#x8FD8;&#x6709;&#x5E2E;&#x52A9;&#x68C0;&#x67E5;SQL&#x8BED;&#x53E5;&#x7684;&#x804C;&#x8D23;&#x3002;&#x8FD9;&#x6837;&#x770B;&#x6765;&#xFF0C;&#x638C;&#x63E1;SQL&#x8BED;&#x53E5;&#x4E49;&#x4E0D;&#x5BB9;&#x8F9E;&#xFF0C;&#x4E5F;&#x662F;&#x4F60;&#x4F7F;&#x7528;MySQL&#x8D70;&#x5F97;&#x66F4;&#x8FDC;&#x7684;&#x5FC5;&#x7ECF;&#x4E4B;&#x8DEF;&#x554A;&#x4F19;&#x8BA1;&#x3002;</p>
<h3 id="t5&#x591A;&#x52A8;&#x624B;&#x5B9E;&#x8DF5;&#x64CD;&#x4F5C;">&#x591A;&#x52A8;&#x624B;&#x5B9E;&#x8DF5;&#x64CD;&#x4F5C; <a href="#t5&#x591A;&#x52A8;&#x624B;&#x5B9E;&#x8DF5;&#x64CD;&#x4F5C;"> # </a></h3>
<p>&#x6211;&#x4E2A;&#x4EBA;&#x6700;&#x4E0D;&#x559C;&#x6B22;&#x201C;&#x7EB8;&#x4E0A;&#x8C08;&#x5175;&#x6D3E;&#x201D;&#xFF0C;&#x5728;&#x6211;&#x5B66;&#x4E60;&#x540E;&#x7AEF;PHP&#x548C;Node&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x52A8;&#x4E0D;&#x52A8;&#x5C31;&#x8BA9;&#x6211;&#x770B;&#x4E2A;&#x7B97;&#x6CD5;&#xFF0C;&#x770B;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x57FA;&#x7840;&#xFF0C;&#x6211;&#x53EA;&#x662F;&#x5199;&#x4E2A;&#x5E94;&#x7528;&#x800C;&#x5DF2;&#xFF0C;&#x6211;&#x80A9;&#x8D1F;&#x51FA;&#x6D3B;&#x513F;&#x7684;&#x4F7F;&#x547D;&#xFF0C;&#x6211;&#x7684;&#x5B97;&#x65E8;&#x52A8;&#x624B;&#x5B9E;&#x8DF5;&#x64CD;&#x4F5C;&#xFF0C;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x6765;&#x8BF4;&#x5B83;&#x7684;&#x64CD;&#x4F5C;&#x6027;&#x7279;&#x522B;&#x5F3A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x52A8;&#x624B;&#x64CD;&#x4F5C;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#x5F88;&#x96BE;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x3002;&#x4F60;&#x5728;&#x5B9E;&#x9645;&#x64CD;&#x4F5C;&#x4E2D;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x5404;&#x79CD;&#x65B9;&#x6CD5;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x63D0;&#x9AD8;&#x5B9E;&#x6218;&#x5E94;&#x7528;&#x64CD;&#x4F5C;&#x80FD;&#x529B;&#x3002;&#x5728;&#x4F60;&#x5B9E;&#x6218;&#x64CD;&#x4F5C;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x987A;&#x5E26;&#x8865;&#x5145;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x3002;</p>
<h3 id="t6&#x8BB0;&#x5F55;&#x7B14;&#x8BB0;">&#x8BB0;&#x5F55;&#x7B14;&#x8BB0; <a href="#t6&#x8BB0;&#x5F55;&#x7B14;&#x8BB0;"> # </a></h3>
<p>&#x4F60;&#x6709;&#x4E86;&#x4E0A;&#x9762;&#x5FEB;&#x901F;&#x654F;&#x6377;&#x7684;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#xFF0C;&#x4F60;&#x8FD8;&#x5F97;&#x9644;&#x5E26;&#x4E00;&#x4E2A;&#x6280;&#x80FD;&#xFF0C;&#x624D;&#x80FD;&#x66F4;&#x597D;&#x3001;&#x66F4;&#x5FEB;&#x7684;&#x5165;&#x95E8;MySQL&#x6570;&#x636E;&#x5E93;&#x3002;&#x8FD9;&#x4E2A;&#x6280;&#x80FD;&#x5C31;&#x662F;&#x505A;&#x7B14;&#x8BB0;&#xFF0C;&#x505A;&#x7B14;&#x8BB0;&#x5728;&#x6211;&#x8FD9;&#x91CC;&#x8D77;&#x5230;&#x4E09;&#x4E2A;&#x4F5C;&#x7528;&#xFF1A;&#x7B2C;&#x4E00;&#xFF0C;&#x907F;&#x514D;&#x9057;&#x5FD8;&#x77E5;&#x8BC6;&#x70B9;&#x3002;&#x77E5;&#x8BC6;&#x70B9;&#x592A;&#x591A;&#xFF0C;&#x77E5;&#x8BC6;&#x70B9;&#x504F;&#x51B7;&#xFF0C;&#x4E0D;&#x5E38;&#x7528;&#x4E5F;&#x5BB9;&#x6613;&#x5FD8;&#x8BB0;&#xFF0C;<a href="../21-minutes-MySQL-basic-entry.md">&#x300A;21&#x5206;&#x949F;&#x5165;&#x95E8;MySQL&#x300B;</a>&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x6211;&#x505A;&#x7684;&#x7B14;&#x8BB0;&#xFF1B;&#x7B2C;&#x4E8C;&#xFF0C;&#x77E5;&#x8BC6;&#x70B9;&#x5206;&#x9636;&#x6BB5;&#x5403;&#x900F;&#x3002;&#x5F53;&#x4F60;&#x7406;&#x89E3;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x4E00;&#x77E5;&#x534A;&#x89E3;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x4F60;&#x90FD;&#x9700;&#x8981;&#x505A;&#x4E00;&#x4E9B;&#x7B14;&#x8BB0;&#xFF0C;&#x8BB0;&#x5F55;&#x4E4B;&#x540E;&#x627E;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x597D;&#x597D;&#x628A;&#x8FD9;&#x4E9B;&#x4E00;&#x77E5;&#x534A;&#x89E3;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x5403;&#x900F;&#xFF0C;&#x5728;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x53BB;&#x770B;&#x4F60;&#x7684;&#x7B14;&#x8BB0;&#x4F60;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x4E0D;&#x540C;&#x7684;&#x7406;&#x89E3;&#x3002;&#x7B2C;&#x4E09;&#xFF0C;&#x603B;&#x7ED3;&#x6C89;&#x6DC0;&#xFF0C;&#x5F53;&#x4F60;&#x5165;&#x95E8;&#x4E4B;&#x540E;&#x603B;&#x7ED3;&#x6C89;&#x6DC0;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x4E00;&#x6B21;&#x603B;&#x7ED3;&#x6C89;&#x6DC0;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x5728;&#x67D0;&#x4E2A;&#x6280;&#x672F;&#x4E0A;&#x4F60;&#x76F4;&#x63A5;&#x4E0A;&#x5347;&#x4E00;&#x4E2A;&#x53F0;&#x9636;&#x3002;</p>
<h3 id="t7&#x9AD8;&#x7EA7;&#x8FDB;&#x9636;">&#x9AD8;&#x7EA7;&#x8FDB;&#x9636; <a href="#t7&#x9AD8;&#x7EA7;&#x8FDB;&#x9636;"> # </a></h3>
<p>&#x8FD9;&#x91CC;&#x662F;&#x5165;&#x95E8;&#xFF0C;&#x9AD8;&#x7EA7;&#x8FDB;&#x9636;&#x6682;&#x65F6;&#x6CA1;&#x6709;&#xFF0C;&#x1F604;&#x3002;</p>

        <div class="copyright">Powered by <a href="https://github.com/jaywcjlove/idoc" target="_blank">idoc</a>. Dependence <a href="https://nodejs.org">Node.js</a> run.</div>
    </div>
    
</div>


</body>
</html>
